im_sports_master/app/views/divisions/show.html.haml

SELECT "games".* FROM "games" WHERE "games"."division_id" = 1
---

- @division.games.each do |game|

SELECT "teams".* FROM "teams" WHERE "teams"."division_id" = 1
---

- @division.teams.each do |team|

SELECT "locations".* FROM "locations" INNER JOIN "divisions_locations" ON "locations"."id" = "divisions_locations"."location_id" WHERE "divisions_locations"."division_id" = 1
---

- @division.locations.each do |location|