im_sports_master/app/views/teams/show.html.haml

  %b Team Members:
  - @team.users.each do |user|
---
SELECT "users".* FROM "users" INNER JOIN "teams_users" ON "users"."id" = "teams_users"."user_id" WHERE "teams_users"."team_id" = 10

  %b Games:
  - @division.get_games_by_team(@team).each do |game|
---
SELECT "games".* FROM "games" WHERE "games"."division_id" = 1