im_sports_master/app/controllers/divisions_controller.rb

SELECT "divisions".* FROM "divisions" WHERE "divisions"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @division = Division.find(params[:id])

SELECT "leagues".* FROM "leagues" WHERE "leagues"."id" = 3 LIMIT 1
---
    def set_league
      @league = League.find_by_id(params[:league_id])