im_sports_master/app/controllers/games_controller.rb

  def index
    @games = @division.games.all
---
SELECT "games".* FROM "games" WHERE "games"."division_id" = 1

  def edit
    @game = Game.find(params[:id])
---
SELECT "games".* FROM "games" WHERE "games"."id" = ? LIMIT 1  [["id", "5"]]

  def update
    @game = Game.find(params[:id])
    if @game.update_attributes(params[:game])
---
SELECT "games".* FROM "games" WHERE "games"."id" = ? LIMIT 1  [["id", "5"]]
UPDATE "games" SET "score1" = 1, "score2" = 3, "location" = '', "updated_at" = '2013-12-08 19:08:10.153742' WHERE "games"."id" = 5

    def set_league
      @league = League.find_by_id(params[:league_id])
---
SELECT "leagues".* FROM "leagues" WHERE "leagues"."id" = 1 LIMIT 1

    def set_division
      @division = Division.find_by_id(params[:division_id])
---
SELECT "divisions".* FROM "divisions" WHERE "divisions"."id" = 1 LIMIT 1