im_sports_master/app/controllers/leagues_controller.rb

SELECT "leagues".* FROM "leagues"
---
  def index
    @leagues = League.all

SELECT "leagues".* FROM "leagues" WHERE "leagues"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @league = League.find(params[:id])

SELECT "leagues".* FROM "leagues" WHERE "leagues"."id" = ? LIMIT 1  [["id", "26"]]
---
  def edit
    @league = League.find(params[:id])

INSERT INTO "leagues" ("created_at", "name", "sport", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Sun, 08 Dec 2013 12:46:50 UTC +00:00], ["name", "league1"], ["sport", "basketball"], ["updated_at", Sun, 08 Dec 2013 12:46:50 UTC +00:00]]
---
  def create
    @league = League.new(params[:league])

    if @league.save

SELECT "leagues".* FROM "leagues" WHERE "leagues"."id" = ? LIMIT 1  [["id", "26"]]
DELETE FROM "leagues" WHERE "leagues"."id" = ?  [["id", 26]]
---
  def destroy
    @league = League.find(params[:id])
    @league.destroy