im_sports_master/app/controllers/teams_controller.rb

  def index
    @teams = @division.teams.where(:placeholder=>false)
---
SELECT "teams".* FROM "teams" WHERE "teams"."division_id" = 1

  def invite
    @team = Team.find_by_id(params[:team_id])
    user = User.find_by_email(params[:to_invite])
---
SELECT "teams".* FROM "teams" WHERE "teams"."id" = 18 LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."email" = '' LIMIT 1

  def create
    params[:team][:placeholder] = false
    @team = Team.new(params[:team])

    if @team.save
---
INSERT INTO "teams" ("captain_email", "created_at", "division_id", "name", "placeholder", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

    def set_league
      @league = League.find_by_id(params[:league_id])
---
SELECT "leagues".* FROM "leagues" WHERE "leagues"."id" = 1 LIMIT 1

    def set_division
      @division = Division.find_by_id(params[:division_id])
---
SELECT "divisions".* FROM "divisions" WHERE "divisions"."id" = 1 LIMIT 1