hw3/rottenpotatoes/app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = 'Director Name'
---
  def same_director
    @movie = Movie.find params[:id]
    if !@movie.director.empty? and @movie.director