im_sports_master/app/views/leagues/show.html.haml


- @league.divisions.each do |division|
---
SELECT "divisions".* FROM "divisions" WHERE "divisions"."league_id" = 1