im_sports_master/app/views/users/show.html.haml

  %b Teams:
  - @user.teams.each do |team|
---
SELECT "teams".* FROM "teams" INNER JOIN "teams_users" ON "teams"."id" = "teams_users"."team_id" WHERE "teams_users"."user_id" = 1